package com.baizhi.test;

import java.util.HashMap;
import java.util.Map;

public class TestString {
    public static void main(String[] args) {

        String names = "杜甫,白居易,卢纶,韦应物,吕本中,贺铸,柳永,范成大,李商隐,黄孝迈,杜甫,朱淑真,张旭,韦应物,欧阳修,周邦彦,王湾,苏轼,姜夔,李白,辛弃疾,刘长卿,李清照,姜夔,张乔,温庭筠,崔涂,吴文英,张九龄,李商隐,辛弃疾,李商隐,司空曙,贾岛,未知,佚名,王澜,杜甫,刘长卿,刘长卿,李白,如晦,李白,张先,李清照,李商隐,元稹,李元膺,林逋,李清照,李清照,朱淑真,王维,岑参,李白,张祜,李白,韩翃,孟浩然,杜牧,岑参,舒亶,晏几道,刘克庄,孟浩然,严蕊,王琪,崔颢,马戴,欧阳修,杜甫,杜甫,李白,王维,韦应物,郑文妻,李清照,张籍,杜甫,赵令畤,蔡伸,王维,陆游,李白,李白,刘禹锡,柳永,王维,朱庆馀,杜甫,苏轼,舒亶\uE238,孟浩然,李商隐,秦观,贺知章,许棐,吴文英,祖咏,黄升,綦毋潜,杜甫,李商隐,李商隐,李颀,李白,孟浩然,王维,孟浩然,刘昚虚,汤恢,张祜,陆游,韩翃,孟浩然,李白,卢纶,陈亮,韩愈,周邦彦,韩翃,周密,李清照,王翰,史达祖,孟浩然,苏轼,陈与义,孟郊,吴文英,白居易,杜牧,张先,范仲淹,韦庄,王雱,赵崇,戴复古,元稹,张炎,王维,杜甫,谢克家,柳永,崔曙,王勃,李清照,王维,崔颢,皎然,杜甫,蒋氏女,江开,朱敦儒,李白,李清照,杜甫,权德舆,晏几道,裴迪,周邦彦,李端,贺铸,王之涣,杜甫,李颀,苏轼,杜甫,陈子昂,李清照,赵令畤,李清照,钱起,吴文英,李益,岑参,刘长卿,李之仪,赵溍,王之涣,李商隐,沈佺期,陈允平,韦应物,金德淑,宋祁,林逋,华清淑,向子諲,王维,李商隐,李白,李白,未知,吴文英,寇准,佚名,沈佺期,张祜,韦庄,杜牧,卢纶,张九龄,元稹,欧阳修,郑畋,孟浩然,李商隐,杨炎正,刘彤,李白,王维,蜀妓,姜夔,王维,王维,黄庭坚,杜甫,范成大,秦观,苏轼,刘禹锡,孟浩然,辛弃疾,元稹,石孝友,陈达叟,李商隐,晏几道,常建,李清照,晏几道,王昌龄,寇准,韩元吉,常建,张祜,薛逢,杜甫,刘长卿,唐玄宗,周端臣,李白,张元干,白居易,汪元量,李白,唐婉,杜甫,杜甫,淮上女,李商隐,韩愈,李商隐,吕本中,柳永,晏几道,秦观,李商隐,杜甫,宋之问,李清照,毛滂,陆游,杜牧,吴文英,崔涂,王维,辛弃疾,张九龄,白居易,杜甫,杜甫,王维,李清照,曹豳,李商隐,叶清臣,辛弃疾,杜甫,杜荀鹤,李清照,李清照,祖咏,范仲淹,黄大临,李益,杜甫,孟浩然,李商隐,张泌,岑参,白居易,韩愈,岑参,李之仪,秦观,袁正真,李清照,晏几道,李白,秦观,李白,刘长卿,李颀,李益,周密,刘禹锡,崔颢,王昌龄,程垓,秦观,柳永,柳宗元,钱惟演,岳珂,陆游,杜甫,李之仪,杜甫,王维,杜甫,王安国,许浑,洪适,夏竦,李白,李商隐,李好古,王昌龄,高适,岑参,陆游,寇准,李白,韩偓,李白,晁冲之,杜牧,欧阳修,杜牧,欧阳修,姜夔,欧阳修,李白,金昌绪,李商隐,柳永,李清照,张祜,杜甫,杜牧,吴潜,李白,王维,李白,陈陶,吴文英,万俟咏,杜甫,阮逸女,周邦彦,李白,李白,李白,李清照,晏几道,刘方平,杜甫,辛弃疾,王维,高适,吴文英,西鄙人,周邦彦,李商隐,王维,王维,白居易,王清惠,卢纶,刘辰翁,李颀,王维,辛弃疾,晏几道,杜甫,张九龄,苏轼,温庭筠,蔡伸,刘辰翁,丘为,葛长庚,孟浩然,李清照,周密,王昌龄,卢纶,杜审言,晏几道,王禹偁,柳宗元,韦应物,王维,周紫芝,元结,吴文英,李之仪,王维,杜甫,戴叔伦,刘克庄,皇甫冉,赵汝茪,杜甫,连静女,杜甫,温庭筠,孔夷,韦应物,晏几道,韦应物,宋之问,司空曙,卢纶,王雱,王维,吴文英,韩缜,杜牧,赵佶,李白,张元干,刘禹锡,李白,钱起,曹组,贺铸,李白,朱庆馀,王维,吴潜,温庭筠,辛弃疾,李颀,杜甫,韦应物,赵佶,王昌龄,周紫芝,马戴,石孝友,周邦彦,王建,杜甫,岳飞,李颀,柳宗元,李白,崔颢,司空曙,李商隐,晏殊,王维,杜牧,韦应物,汪元量,柳永,陈允平,柳永,刘长卿,向子諲,汪元量,柳宗元,刘方平,杜牧,晏殊,孟浩然,李白,吕本中,杜甫,韦应物,杜甫,王维,李商隐,韩元吉,杜甫,李商隐,元结,杜甫,王维,骆宾王,韦应物,张九龄,孟浩然,李清照,刘长卿,秦观,万俟咏,韦应物,王维,晏殊,李商隐,王维,李清照,王昌龄,辛弃疾,李颀,李清照,许浑,张孝祥,吴文英,刘长卿,柳中庸,李清照,王昌龄,苏轼,孟浩然,刘长卿,李商隐,孟郊,孟浩然,洪皓,岑参,钱起,顾况,蒋捷,程垓,李白,王维,杜甫,李白,秦韬玉,高观国,韩愈,王安石,晏几道,张继,刘长卿,欧阳修,辛弃疾";

        Map<String,Integer> map = new HashMap<>();
        String[] split = names.split(",");
        for (String s : split) {
            if(!map.containsKey(s)){
                map.put(s,1);
            }else {
                map.put(s,map.get(s)+1);
            }
        }
        StringBuilder stringBuilder = new StringBuilder();
        map.forEach((key,value)->{
            if(value>7){
                //System.out.println(key);
                stringBuilder.append(key+"|");
            }
        });

        System.out.println(stringBuilder.toString());

    }
}
